# ExportFontInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontInfo Class
Members See Also
---
A value used to represent the info stored in an ExportFontTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportFontInfo : IDisposable
```

Visual Basic
---
```text
Public Class ExportFontInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportFontInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportFontInfo
# See Also
ExportFontInfo Members
Autodesk.Revit.DB Namespace